{
  "auto_mapping": null,
  "base_model_name_or_path": "tokyotech-llm/Swallow-7b-hf",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "revision": null,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "down_proj",
    "up_proj",
    "gate_proj"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "use_rslora": true
}
